login_test/tsung_login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="RedDiamond-fix.eba-2ztxhtsv.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
    <!-- adding csv file with user-email and user-password for login -->
   <option name="file_server" id="userlist" value=".tsung/example_userlist.csv"/>
  </options>

  <sessions>
    
    <session name="group_view" type="ts_http" weight="1">
      <request><http method="GET" url="/"></http></request>
      <request><http method="GET" url="/games/1/groups"></http></request>
      <!-- thinktime of user is random but between 2 and 5 seconds -->
      <thinktime random="true" min="2" max="5"/>
      <!-- sets dynamic variables from csv list with id userlist -->
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="iter">
        <var name="user_email" />
        <var name="user_password" />
      </setdynvars>
      <request>
        <!-- sets dynamic variable from hidden form field authenticity_token -->
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/users/sign_in' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>
      <!-- parses dynamic variables user_email, user_password and authenticity_token to url-encoded variables -->
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(user_email,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_user_email" />
      </setdynvars>
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(user_password,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_user_password" />
      </setdynvars>
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token" />
      </setdynvars>
      <!-- for using dynamic variables the request has to be subst="true"-->
      <request subst="true">
        <!-- sets encoded dynamic variables for authenticity_token, user-email and user-password-->
        <http url='/users/sign_in' version='1.1'
          contents='authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=%%_encoded_user_email%%&amp;user%5Bpassword%5D=%%_encoded_user_password%%&amp;user%5Bremember_me%5D=0&amp;commit=Log+in'
          content_type='application/x-www-form-urlencoded'
          method='POST'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>
    </session>

  </sessions>
</tsung>